Catalogs/pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.pcru_ex_ТипыРегламентныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыполненияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроводок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяПроводка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.pcru_ex_НастройкиПроводокNAV</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполняется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыполненияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияВыполненияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.pcru_ex_СтатусыОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроводкиДляЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаПроводокNAV</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.pcru_ex_НастройкиПроводокNAV</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОчиститьСтатусНаСервере(Ссылка)
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Выполнено = Ложь;
	Объект.Результат = "";
	Объект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатус(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСтатусНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли; 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьВРучномРежимеНаСервере(Ссылка)
	pcru_ex_РегламентныеОперации.ВыполнитьРегламентнуюОперацию(Ссылка);	//ФоновыеЗадания.Выполнить("pcru_ex_РегламентныеОперации.ВыполнитьРегламентныеОперации", Новый Массив);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВРучномРежиме(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСтатусНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
		ЗапуститьВРучномРежимеНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗагрузки()
	ОбновитьСтатусЗагрузкиСрв();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусЗагрузкиСрв()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  ПЕРВЫЕ 1
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяДата КАК ТекущаяДата,
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяПроводка КАК ТекущаяПроводка,
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяСтрока КАК ТекущаяСтрока,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоДат = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.НомерДаты / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоДат * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентДат,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоПроводок = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.НомерПроводки / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоПроводок * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентПроводок,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоСтрок = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяСтрока / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоСтрок * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентСтрок
	|ИЗ
	|	Справочник.pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий КАК pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий
	|ГДЕ
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Выполняется";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
//		Элементы.СтатусЗагрузки.Видимость = Истина;	
		ЭтаФорма.ПроцентЗагрузки = Выборка.ПроцентДат;
		ЭтаФорма.ТекущаяДата = Выборка.ТекущаяДата;
		ЭтаФорма.ПроцентЗагрузки1 = Выборка.ПроцентПроводок;
		ЭтаФорма.ТекуцаяПроводка = Выборка.ТекущаяПроводка;
		
	//Иначе
	//	Элементы.СтатусЗагрузки.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры // ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьСтатусЗагрузки", 30);
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессЗагрузкиВФоне(Команда)
	
	Элементы.ГруппаПрогрессЗагрузки.Видимость = НЕ Элементы.ГруппаПрогрессЗагрузки.Видимость;

КонецПроцедуры
